app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "nam"], ["email", "email@email.com"], ["password", "12345678"], ["created_at", "2020-06-22 19:14:54.127771"], ["updated_at", "2020-06-22 19:14:54.127771"]]

  def update
    respond_to do |format|
  if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "miguel@email.com"], ["updated_at", "2020-06-23 14:13:21.598918"], ["id", 4]]